[
    {
        "id": 1,
        "name": "Lead Generator/ Converter Intern",
        "type": "Graduate Internship",
        "remote":"Yes",
        "description": "MTC is looking for Lead Generator / Converter intern to handle & putting ideas in an organizational growth. You will be working closely with team members to track and scheduled all projects requirements and deadlines. If you are a learning student and want to be a professional in it, then you are right place .."
    },
    {
        "id": 2,
        "name": "Event management - Intern",
        "type": "Graduate Internship",
        "remote":"Yes",
        "description": "MTC is looking  for an excellent and talented Agile project engineer intern to initiate an outstanding  part in our organizational growth. If you are good at collecting customer feedback, manpower planning and monitoring & controlling also want to be a professional in it, then you are at a right place.  "
    },
    {
        "id": 3,
        "name": "Operations Executive Intern",
        "type": "Graduate Internship",
        "remote":"Yes",
        "description": "MTC is looking for Operations Executive Intern who wants to gain industry experience in performing administrative tasks and supporting our Operations team. If you are ready to start your profession as an Operations Executive and get real-time experience in operation processes, then you are at the right place. As an Operations Executive Intern, your roles and responsibilities will be as follows:"
    },
    {
        "id": 4,
        "name": "Learning & Development Executive - Intern",
        "type": "Graduate Internship",
        "remote":"Yes",
        "description": "MTC is looking for an excellent and talented L&D intern to initiate an outstanding part in our organizational growth. If you are passionate of your work and desperately want to create a high-quality magnificent strategic ideas, research and development and want to be a professional in it, then you are at right place. "
    },
    {
        "id": 5,
        "name": "Electrical Engineer- Intern",
        "type": "Graduate Internship",
        "remote":"Yes",
        "description": "Create electrical workshops and Electrical courses Conduct Electrics Webinars to students and manage documentation of all the electrical workshops and electrical courses Ability to simulate electrical applications."
    },
    {
        "id": 6,
        "name": "Course Creator/ Developer- Intern",
        "type": "Graduate Internship",
        "remote":"Yes",
        "description": "MTC is looking for an excellent and talented Course Creator and Course testing intern to initiate an outstanding part in our organizational growth. If you are passionate about your work and desperately want to create a high-quality magnificent strategic ideas, and very much acquainted in developing virtual learning Materials, then you are at a right place."
    }


]